Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum
Sharing privilege.

Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum.NONE
No privilege.

Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum.VIEWER
Read privilege.

Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum.EDITOR
Read and write privileges.

Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum.OWNER
Read, write and owner privileges.

Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum.NOT_AUTHORIZED
Sharing feature not enabled for current user.

Tekla.Structures.ModelInternal.Operation.DotSharingPrivilegeEnum.PROJECT_VIEWER
Read and project viewer write privileges.